import java.util.ArrayList;


public class Homework_6 {
    /* а. Приведите пример использования амортизированного анализа в практике.
    Например если человек делает торты на заказ.
Чтобы вести этот бизнес условно бесконечно, нужно учитывать амортизацию,
потому что из строя могут выйти электроприборы которые используются для приготовления тортов (миксер, печь и т.д.).
Часть дохода должна регулярно откладываться чтобы потом можно было без проблем купить новую бытовую технику.
При расчете стоимости одного торта нужно учитывать не только стоимость продуктов, но и амортизацию.
     */


    /*
    b. Рассмотрите задачу динамического увеличения массива. Реализуйте функцию,
    которая принимает на вход массив и число элементов, и возвращает новый массив, который содержит
    все элементы исходного массива и заданное число новых элементов.
     */

    public static class Array {

        public static void main(String[] args) {

        ArrayList<String> arrayList = new ArrayList<String>(100);
            arrayList.add("Mark");
            arrayList.add("John");
            arrayList.add("Brendon");
            arrayList.add("Tomi");
            arrayList.add("Margo");

            for (String list: arrayList) {
                System.out.println(list);
            }
        }
}
}
